Repository: webroru/commerce_avangard
Catalog: translations/commerce_avangard.*.po
Languages: ru

source: Bank Card (VISA / MasterCard / MaestroCard)
ru: Пластиковая карта банка (VISA / MasterCard / MaestroCard)

source: Integration with Avangard API.
ru: Интеграция с Avangard API.

source: Merchant ID
ru: ID продавца

source: This is the merchant ID that Avangard sent you when you set up your account.
ru: Банк Авангард высылает вам ID продавца после регистрации вашего аккаунта.

source: Password
ru: Пароль

source: This is the hash password that Avangard sent you.
ru: Хэш пароля, который присваивает вам Банк Авангард

source: Pay via VISA / MasterCard / MaestroCard
ru: Оплатить при помощи VISA / MasterCard / MaestroCard

source: The Avangard gateway has not been correctly configured - see watchdog for details. Cannot proceed with payment
ru: Неверно сконфигурированы настройки Авангарда. Пожалуйста, смотрите более детальную информацию в системном журнале. Оплата отменена.

source: Pay via Bank Card
ru: Оплата банковской картой

source: The order does not exist.
ru: Заказ не существует.

source: The result code does not exist.
ru: Код ответа не существует.

source: Payment canceled
ru: Платеж отменен

source: Payment success
ru: Платеж принят

source: The payment has pending.
ru: Платеж в ожидании.

source: The payment has canceled.
ru: Платеж отменен.

source: %method : Merchant id and hash password have not been set in the payment settings. Cannot proceed with transaction
ru: %method : ID продавца и хэш пароля не были установлены в настройках. Транзакция невозможна.

source: %payment_method Payment failed: %message
ru: %payment_method Ошибка оплаты: %message

source: Provides integration with the Avangard API
ru: Предоставляет интеграцию с API Банка Авангард
